<a href="https://colab.research.google.com/github/PiotrJaniec/machine-learning-bootcamp/blob/main/data_extraction.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd
import sklearn

In [4]:
def fetch_financial_data(company = 'AMZN'):
  import pandas_datareader.data as web
  return web.DataReader(name = company, data_source='stooq')

df_raw = fetch_financial_data()
df_raw.head()

                 Open     High       Low    Close   Volume
Date
2020-12-29  3309.9400  3350.65  3281.223  3322.00  4872933
2020-12-28  3194.0000  3304.00  3172.690  3283.96  5686787
2020-12-24  3193.9000  3202.00  3169.000  3172.69  1451917
2020-12-23  3205.0000  3210.13  3184.170  3185.27  2093787
2020-12-22  3202.8434  3222.00  3180.080  3206.52  2381781

In [5]:
df = df_raw.copy()
df = df[:5]
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 5 entries, 2020-12-29 to 2020-12-22
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Open    5 non-null      float64
 1   High    5 non-null      float64
 2   Low     5 non-null      float64
 3   Close   5 non-null      float64
 4   Volume  5 non-null      int64
dtypes: float64(4), int64(1)
memory usage: 240.0 bytes

In [6]:
df['day'] = df.index.day
df['month']= df.index.month
df['year'] = df.index.year

In [7]:
df

                 Open     High       Low    Close   Volume  day  month  year
Date
2020-12-29  3309.9400  3350.65  3281.223  3322.00  4872933   29     12  2020
2020-12-28  3194.0000  3304.00  3172.690  3283.96  5686787   28     12  2020
2020-12-24  3193.9000  3202.00  3169.000  3172.69  1451917   24     12  2020
2020-12-23  3205.0000  3210.13  3184.170  3185.27  2093787   23     12  2020
2020-12-22  3202.8434  3222.00  3180.080  3206.52  2381781   22     12  2020

In [8]:
df = pd.DataFrame(data={'height': [175., 178.5, 185., 191., 184.5, 183., 168.]})
df

   height
0   175.0
1   178.5
2   185.0
3   191.0
4   184.5
5   183.0
6   168.0

In [9]:
df['height_cat'] = pd.cut(x=df.height, bins=3)

In [10]:
df

   height          height_cat
0   175.0  (167.977, 175.667]
1   178.5  (175.667, 183.333]
2   185.0    (183.333, 191.0]
3   191.0    (183.333, 191.0]
4   184.5    (183.333, 191.0]
5   183.0  (175.667, 183.333]
6   168.0  (167.977, 175.667]

In [11]:
df['height_cat'] = pd.cut(x=df.height, bins=(160, 175, 180, 195))

In [12]:
df

   height  height_cat
0   175.0  (160, 175]
1   178.5  (175, 180]
2   185.0  (180, 195]
3   191.0  (180, 195]
4   184.5  (180, 195]
5   183.0  (180, 195]
6   168.0  (160, 175]

In [13]:
df['height_cat'] = pd.cut(x=df.height, bins=(160, 175, 180, 195), labels = ['small', 'medium', 'high'])

In [14]:
df

   height height_cat
0   175.0      small
1   178.5     medium
2   185.0       high
3   191.0       high
4   184.5       high
5   183.0       high
6   168.0      small

In [15]:
pd.get_dummies(df, drop_first=True, prefix='height')

   height  height_medium  height_high
0   175.0              0            0
1   178.5              1            0
2   185.0              0            1
3   191.0              0            1
4   184.5              0            1
5   183.0              0            1
6   168.0              0            0

In [16]:
df = pd.DataFrame(data={'lang': [['PL', 'ENG'], ['GER', 'ENG', 'PL', 'FRA'], ['RUS']]})
df

                  lang
0            [PL, ENG]
1  [GER, ENG, PL, FRA]
2                [RUS]

In [18]:
df['lang_number'] = df['lang'].apply(len)
df

                  lang  lang_number
0            [PL, ENG]            2
1  [GER, ENG, PL, FRA]            4
2                [RUS]            1

In [19]:
df['PL_flag'] = df['lang'].apply(lambda x:1 if 'PL' in x else 0)
df

                  lang  lang_number  PL_flag
0            [PL, ENG]            2        1
1  [GER, ENG, PL, FRA]            4        1
2                [RUS]            1        0

In [20]:
df = pd.DataFrame(data={'website': ['wp.pl', 'onet.pl', 'google.com']})
df

      website
0       wp.pl
1     onet.pl
2  google.com

In [22]:
new = df.website.str.split('.', expand=True)
df['portal'] = new[0]
df['extension'] = new[1]
df

      website  portal extension
0       wp.pl      wp        pl
1     onet.pl    onet        pl
2  google.com  google       com